Diplom/src/Documents/BKM_ОбслуживаниеКлиента/BKM_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.BKM_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.BKM_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/AccumulationRegisters/BKM_ВыполненныеКлиентуРаботы/BKM_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom/src/AccumulationRegisters/BKM_ВыполненныеСотрудникомРаботы/BKM_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom/src/InformationRegisters/BKM_УсловияОплатыСотрудников/BKM_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BKM_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРабот</name>
    <type>
      <types>CatalogRef.BKM_ГрафикиРабот</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>BKM_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Diplom/src/Documents/BKM_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОписаниеПеременных

	Перем СообщениеТелеграмБоту; // СообщениеТелеграмБоту до записи объекта в базу  

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверкаЗаполненияДокумента(Отказ);
	
	Если Отказ Тогда	
		Возврат;	
	КонецЕсли; 
	
	ПроцентОплатыОтРабот = ПолучитьПроцентОплатыОтРабот(Дата, Специалист);
	Если ПроцентОплатыОтРабот = Неопределено Тогда 
		
		ТекстСообщения = СтрШаблон("Документ не проведен. У сотрудника %1 не установлен процент оплаты от выполненных работ.", Специалист);	
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,,,Отказ);
		
	КонецЕсли;
	
	Движения.BKM_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.BKM_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	ИтогоЧасыКОплате = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	СтавкаЧаса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"BKM_СтоимостьЧасаРаботыСпециалиста");
    СуммаКОплате = ИтогоЧасыКОплате * СтавкаЧаса;
	
	//Движения по регистру BKM_ВыполненныеКлиентуРаботы 
	Движение = Движения.BKM_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ИтогоЧасыКОплате;
	Движение.СуммаКОплате = СуммаКОплате; 
	
	//Движения по регистру BKM_ВыполненныеСотрудникомРаботы 
	Движение = Движения.BKM_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
	Движение.СуммаКОплате = СуммаКОплате * ПроцентОплатыОтРабот / 100;
	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеТелеграмБоту = СформироватьСообщениеТелеграмБоту();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
     	
     	Возврат;
     	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеТелеграмБоту) Тогда 
		СообщениеТелеграмБоту = СтрЗаменить(СообщениеТелеграмБоту,"№Заявки",ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер));
		Если Справочники.BKM_УведомленияТелеграмБоту.ДобавитьУведомление(СообщениеТелеграмБоту) = Неопределено Тогда
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Формирование уведомления в справочнике. Запись не создана.", УровеньЖурналаРегистрации.Ошибка);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаЗаполненияДокумента(Отказ)
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, BKM_ДатаНачалаДействияДоговора, BKM_ДатаОкончанияДействияДоговора");
    
    
    Если РеквизитыДоговора.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание") Тогда 
        
        ТекстСообщения = "Отказ в проведении документа. Выберите договор с типом Абонентское обслуживание.";
        
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);	
        
    Иначе
        
       
        Если РеквизитыДоговора.BKM_ДатаНачалаДействияДоговора > Дата Или РеквизитыДоговора.BKM_ДатаОкончанияДействияДоговора < Дата Тогда
            
            ТекстСообщения = "Отказ в проведении документа. Договор не действует на дату документа.";
            
            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",Отказ);	
            
        КонецЕсли;
        
    КонецЕсли;  
                
	

КонецПроцедуры

Функция ПолучитьПроцентОплатыОтРабот(Дата, Специалист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BKM_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.BKM_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник = &Сотрудник) КАК
	|		BKM_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ПроцентОтРабот;
		
	Иначе   
		
		Возврат Неопределено; 
		
	КонецЕсли;
	
КонецФункции


Функция СформироватьСообщениеТелеграмБоту()
	
	ТекстСообщения = "";
	Если ЭтоНовый() Тогда
		
		ТекстСообщения = "Создана новая заявка на обслуживание клиента";
		
	Иначе
		
		СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
		"ДатаПроведенияРабот, ВремяНачалаРаботПлан, ВремяОкончанияРаботПлан, Специалист");
		
		ИзмененныеРеквизиты = Новый Структура;
		ИзмененныеРеквизиты.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		ИзмененныеРеквизиты.Вставить("ВремяНачалаРаботПлан", ВремяНачалаРаботПлан);
		ИзмененныеРеквизиты.Вставить("ВремяОкончанияРаботПлан", ВремяОкончанияРаботПлан);
		ИзмененныеРеквизиты.Вставить("Специалист", Специалист);
		
		Если  Не ОбщегоНазначения.ДанныеСовпадают(СтарыеРеквизиты, ИзмененныеРеквизиты) Тогда
			
			ТекстСообщения = "Произошли изменения в заявке на обслуживание клиента";
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ТекстСообщения <> "" Тогда
		
		ТекстСообщения = СтрШаблон("%1 №№Заявки от %2.
						|Контрагент %3.
						|Дата проведения работ запланирована на %4 с %5 по %6.
						|Назначен специалист: %7.",
						ТекстСообщения, 
						Формат(Дата,"ДФ=dd.MM.yyyy"), Клиент, Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"),
						Формат(ВремяНачалаРаботПлан,"ДФ=ЧЧ.мм"),Формат(ВремяОкончанияРаботПлан,"ДФ=ЧЧ.мм"), Специалист);
		
	КонецЕсли;
	
    Возврат ТекстСообщения; 
	
КонецФункции

#КонецОбласти
